// TODO
// Страница тяжёлая:
// Для неавторизованного пользователя
// Первый снимок: слева - название курса и модули курса, справа описание курса
// Второй снимок (после нажатия на модуль курса): слева - название курса и модули курса, справа -
// описание модуля и его задания (только названия)
// Для авторизованного пользователя
// Первый снимок: то же, что и для неавторизованного пользователя 
// Второй снимок (после нажатия на модуль курса): слева - название курса и модули курса, справа -
// описание модуля и его задания (только названия). Пройденные задания выделяются. Также мб 
// просмотрен ответ (если присутствует) на задание
// Написать бэкенд чекпоинт на получение курса с модулями с заданиями
//  (запрос на задания отдельно) (не авторизованный) 
// Написать бэкенд чекпоинт на получение курса с модулями с заданиями
//  и пройденными заданиями, вопросами и ответами (заданиями и пройденными заданиями, вопросами и ответами) (авторизованный) 
// Получать их через state 
// Написать компонент-карточку вопроса и ответа
// ответы мб удалены. В таком случае задание снова становится доступным